#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
aws_vpc.this: Refreshing state... [id=vpc-0a34cc7aa9ab4a18f]
aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:428654095624:targetgroup/LB-TG/e67209becbaa23df]
aws_route_table.private: Refreshing state... [id=rtb-054c9885c3f9192c4]
aws_security_group.lb: Refreshing state... [id=sg-064f48d9bfed399bb]
aws_subnet.this["pub_b"]: Refreshing state... [id=subnet-014b64dbe1018cde5]
aws_subnet.this["pvt_a"]: Refreshing state... [id=subnet-004a42fb567a2c9db]
aws_subnet.this["pub_a"]: Refreshing state... [id=subnet-0d4deddfbb5a91fb4]
aws_internet_gateway.this: Refreshing state... [id=igw-0f807cdfe5f7c6352]
aws_subnet.this["pvt_b"]: Refreshing state... [id=subnet-0469e452ea59238e0]
aws_security_group.autoscaling: Refreshing state... [id=sg-0cd94bbcd7416b122]
aws_security_group.web: Refreshing state... [id=sg-07fc4a5ed2155b2bb]
aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:428654095624:loadbalancer/app/Terraform-LoadBalance/7e5369e3022a1dd1]
aws_route_table.public: Refreshing state... [id=rtb-048fac182ed8ff16b]
aws_route_table_association.this["Private A"]: Refreshing state... [id=rtbassoc-0a189d45a98bde555]
aws_route_table_association.this["Private B"]: Refreshing state... [id=rtbassoc-0bc1ddc01b95d2ce2]
aws_route_table_association.this["Public A"]: Refreshing state... [id=rtbassoc-0ee4f2d65c5657216]
aws_route_table_association.this["Public B"]: Refreshing state... [id=rtbassoc-017054035c06c1d8c]
aws_security_group.db: Refreshing state... [id=sg-0a40b35c4c89b3b60]
aws_lb_listener.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:428654095624:listener/app/Terraform-LoadBalance/7e5369e3022a1dd1/f6d8f8e381aac8f7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lb.this must be replaced
-/+ resource "aws_lb" "this" {
      ~ arn                                         = "arn:aws:elasticloadbalancing:us-east-1:428654095624:loadbalancer/app/Terraform-LoadBalance/7e5369e3022a1dd1" -> (known after apply)
      ~ arn_suffix                                  = "app/Terraform-LoadBalance/7e5369e3022a1dd1" -> (known after apply)
      ~ dns_name                                    = "Terraform-LoadBalance-965386826.us-east-1.elb.amazonaws.com" -> (known after apply)
      - enable_cross_zone_load_balancing            = true -> null
      ~ id                                          = "arn:aws:elasticloadbalancing:us-east-1:428654095624:loadbalancer/app/Terraform-LoadBalance/7e5369e3022a1dd1" -> (known after apply)
      ~ internal                                    = false -> (known after apply)
      ~ ip_address_type                             = "ipv4" -> (known after apply)
      ~ name                                        = "Terraform-LoadBalance" -> "terraform-lb" # forces replacement
        tags                                        = {
            "ManagedBy" = "Terraform"
            "Name"      = "Load Balance"
            "Project"   = "CI/CD-Metabase"
            "Service"   = "APP"
        }
      ~ vpc_id                                      = "vpc-0a34cc7aa9ab4a18f" -> (known after apply)
      ~ zone_id                                     = "Z35SXDOTRQ7X7K" -> (known after apply)
        # (14 unchanged attributes hidden)

      - access_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-014b64dbe1018cde5" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0d4deddfbb5a91fb4" -> null
        }
    }

  # aws_lb_listener.this must be replaced
-/+ resource "aws_lb_listener" "this" {
      ~ arn               = "arn:aws:elasticloadbalancing:us-east-1:428654095624:listener/app/Terraform-LoadBalance/7e5369e3022a1dd1/f6d8f8e381aac8f7" -> (known after apply)
      ~ id                = "arn:aws:elasticloadbalancing:us-east-1:428654095624:listener/app/Terraform-LoadBalance/7e5369e3022a1dd1/f6d8f8e381aac8f7" -> (known after apply)
      ~ load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:428654095624:loadbalancer/app/Terraform-LoadBalance/7e5369e3022a1dd1" # forces replacement -> (known after apply) # forces replacement
      + ssl_policy        = (known after apply)
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ default_action {
          ~ order            = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @vanessafso, Action: `pull_request`*